# GetUnitsMultiplier Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..GetUnitsMultiplier Method
AnalysisResultSchema Class See Also
---
returns units multiplier by index
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double GetUnitsMultiplier(
	int index
)
```

Visual Basic
---
```text
Public Function GetUnitsMultiplier ( _
	index As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetUnitsMultiplier(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 index of unit in the list
# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace